module Address

  ADDRESS_KEYWORDS = {
      13 => {:name => ['東京'],           :key => [
          '東京', 'tokyo', '渋谷', '新宿', '池袋', '目黒', '青山', '代々木', '千代田区', '江東区', '中野区', '港区', '文京区', '八王子市', '小平市']},
      14 => {:name => ['神奈川', '横浜', '川崎'], :key => ['神奈川県', '横浜市', '川崎市', '横須賀', '鶴見区']},
      11 => {:name => ['埼玉'],           :key => ['埼玉県', 'さいたま', '川口市']},
      12 => {:name => ['千葉', '船橋'],   :key => ['千葉県', '船橋市']},
      1 => {:name => ['北海道', '札幌'], :key => ['北海道', '札幌市']},
      2 => {:name => ['青森'],           :key => ['青森県', '八戸市']},
      3 => {:name => ['岩手'],           :key => ['岩手県']},
      4 => {:name => ['宮城'],           :key => ['宮城県']},
      5 => {:name => ['秋田'],           :key => ['秋田県']},
      6 => {:name => ['山形'],           :key => ['山形県']},
      7 => {:name => ['福島', '仙台'],   :key => ['福島県', '仙台市']},
      8 => {:name => ['茨城'],           :key => ['茨城県']},
      9 => {:name => ['栃木'],           :key => ['栃木県']},
      10 => {:name => ['群馬'],           :key => ['群馬県']},
      23 => {:name => ['愛知', '名古屋'], :key => ['愛知県', '名古屋市', '岡崎市']},
      22 => {:name => ['静岡', '浜松'],   :key => ['静岡県', '浜松市', '沼津市']},
      21 => {:name => ['岐阜'],           :key => ['岐阜県']},
      20 => {:name => ['長野'],           :key => ['長野県', '松本市', '塩尻市']},
      16 => {:name => ['富山'],           :key => ['富山県']},
      17 => {:name => ['石川', '金沢'],   :key => ['石川県', '金沢市']},
      18 => {:name => ['福井'],           :key => ['福井県']},
      15 => {:name => ['新潟'],           :key => ['新潟県']},
      19 => {:name => ['山梨'],           :key => ['山梨県']},
      27 => {:name => ['大阪', '堺市'],   :key => ['大阪府', '大阪市', '堺市', '梅田']},
      28 => {:name => ['兵庫', '神戸'],   :key => ['兵庫県', '神戸市', '西宮市']},
      26 => {:name => ['京都'],           :key => ['京都府', '京都市']},
      25 => {:name => ['滋賀'],           :key => ['滋賀県']},
      29 => {:name => ['奈良'],           :key => ['奈良県', '奈良市']},
      30 => {:name => ['和歌山'],         :key => ['和歌山']},
      24 => {:name => ['三重'],           :key => ['三重県']},
      34 => {:name => ['広島'],           :key => ['広島県', '福山市']},
      33 => {:name => ['岡山'],           :key => ['岡山県']},
      31 => {:name => ['鳥取'],           :key => ['鳥取県']},
      32 => {:name => ['島根'],           :key => ['島根県']},
      35 => {:name => ['山口'],           :key => ['山口県']},
      37 => {:name => ['香川'],           :key => ['香川県']},
      38 => {:name => ['愛媛', '松山'],   :key => ['愛媛県', '松山市']},
      36 => {:name => ['徳島'],           :key => ['徳島県', '徳島市']},
      39 => {:name => ['高知'],           :key => ['高知県', '高知市']},
      40 => {:name => ['福岡', '博多', '北九州'],   :key => ['福岡県', '福岡市', '博多', '北九州市', '飯塚市']},
      43 => {:name => ['熊本'],           :key => ['熊本県']},
      42 => {:name => ['長崎'],           :key => ['長崎県']},
      41 => {:name => ['佐賀'],           :key => ['佐賀県']},
      44 => {:name => ['大分'],           :key => ['大分県']},
      45 => {:name => ['宮崎'],           :key => ['宮崎県']},
      46 => {:name => ['鹿児島'],         :key => ['鹿児島']},
      47 => {:name => ['沖縄'],           :key => ['沖縄県', '那覇']},
  }

  #
  # 住所から都道府県を判定する
  #
  def get_area_from_address(address)

    if address.blank? then
      return nil
    end

    # 住所の先頭の文字列で判定する
    ADDRESS_KEYWORDS.each do |area, keyword|
      keyword_names = keyword[:name]
      keyword_names.each do |k|
        if /^#{k}/ =~ address then
          return area
        end
      end
    end

    # 住所の全体の文字列で判定する
    ADDRESS_KEYWORDS.each do |area, keyword|
      keyword_keys = keyword[:key]
      keyword_keys.each do |k|
        if /#{k}/i =~ address then
          return area
        end
      end
    end

    #puts address

    return nil
  end

end